# IsEqual Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayDiagramSettings..::..IsEqual Method
AnalysisDisplayDiagramSettings Class See Also
---
Compares two diagram settings objects.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsEqual(
	AnalysisDisplayDiagramSettings other
)
```

Visual Basic
---
```text
Public Function IsEqual ( _
	other As AnalysisDisplayDiagramSettings _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqual(
	AnalysisDisplayDiagramSettings^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Analysis..::..AnalysisDisplayDiagramSettings Diagram settings object to compare with.
# ### Return Value
True if objects are equal, false otherwise.
# See Also
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace